testkit.older/selftest/socket/request.txt

POST /tf6/services/xdsrepositoryb HTTP/1.1
Content-Type: multipart/related; boundary=MIMEBoundaryurn_uuid_8D3C3AFA28B895245C1247499530740; type="application/xop+xml"; start="<0.urn:uuid:8D3C3AFA28B895245C1247499530741@apache.org>"; start-info="application/soap+xml"; action="urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b"
User-Agent: Axis2
Host: ihexds.nist.gov:9005
Content-Length: 19506

--MIMEBoundaryurn_uuid_8D3C3AFA28B895245C1247499530740
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: binary
Content-ID: <0.urn:uuid:8D3C3AFA28B895245C1247499530741@apache.org>

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action soapenv:mustUnderstand="1">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action><wsa:To soapenv:mustUnderstand="1">http://ihexds.nist.gov:9005/tf5/services/xdsrepositoryb</wsa:To><wsa:MessageID>urn:uuid:2fa9eeec-8fa8-1888-3b43-0800271b8967</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address></wsa:ReplyTo></soapenv:Header><soapenv:Body><ihe:ProvideAndRegisterDocumentSetRequest xmlns:ihe="urn:ihe:iti:xds-b:2007"><lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><rim:RegistryObjectList><rim:ObjectRef id="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" /><rim:ObjectRef id="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" /><rim:ObjectRef id="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" /><rim:ObjectRef id="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" /><rim:ObjectRef id="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" /><rim:ObjectRef id="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" /><rim:ObjectRef id="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" /><rim:ObjectRef id="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" /><rim:ObjectRef id="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" /><rim:ObjectRef id="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" /><rim:ObjectRef id="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" /><rim:ObjectRef id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" /><rim:ObjectRef id="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" /><rim:ObjectRef id="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" /><rim:ObjectRef id="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" /><rim:ObjectRef id="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" /><rim:ObjectRef id="urn:uuid:1ba97051-7806-41a8-a48b-8fce7af683c5" /><rim:ObjectRef id="urn:uuid:75df8f67-9973-4fbe-a900-df66cefecc5a" /><rim:ObjectRef id="urn:uuid:f64ffdf0-4b97-4e06-b79f-a52b38ec2f8a" /><rim:ObjectRef id="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" /><rim:ObjectRef id="urn:uuid:d9d542f3-6cc4-48b6-8870-ea235fbc94c2" /><rim:ObjectRef id="urn:uuid:2d03bffb-f426-4830-8413-bab8537a995b" /><rim:RegistryPackage id="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967"><rim:Slot name="submissionTime"><rim:ValueList><rim:Value>20090713083850</rim:Value></rim:ValueList></rim:Slot><rim:Name /><rim:Description /><rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967" id="cs124749953058233761718304041994791" nodeRepresentation="Summarization of episode"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon contentTypeCodes</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="Summarization of episode" xml:lang="en-us" /></rim:Name></rim:Classification><rim:ExternalIdentifier id="i124749953058222729924375256956611" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967" value="509b043eb50145b^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO"><rim:Name><rim:LocalizedString value="XDSSubmissionSet.patientId" /></rim:Name></rim:ExternalIdentifier><rim:ExternalIdentifier id="i1247499530582-17765935012855111992" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967" value="1.3.6.1.4.1.21367.2009.1.2.162"><rim:Name><rim:LocalizedString value="XDSSubmissionSet.sourceId" /></rim:Name></rim:ExternalIdentifier><rim:ExternalIdentifier id="i1247499530582-31109852016407011083" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967" value="1.3.6.1.4.1.21367.2009.1.2.182.097130838508642"><rim:Name><rim:LocalizedString value="XDSSubmissionSet.uniqueId" /></rim:Name></rim:ExternalIdentifier></rim:RegistryPackage><rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967" id="cl1247499530592-50094476292396162690" nodeRepresentation="" /><rim:ExtrinsicObject id="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"><rim:Slot name="creationTime"><rim:ValueList><rim:Value>20090629235752</rim:Value></rim:ValueList></rim:Slot><rim:Slot name="languageCode"><rim:ValueList><rim:Value>en-US</rim:Value></rim:ValueList></rim:Slot><rim:Slot name="legalAuthenticator"><rim:ValueList><rim:Value>11111111^Wiseman^Bernard^^Sr.^Dr.^^^&amp;1.3.5.35.1.4436.7&amp;ISO</rim:Value></rim:ValueList></rim:Slot><rim:Slot name="serviceStartTime"><rim:ValueList><rim:Value>20090629235752</rim:Value></rim:ValueList></rim:Slot><rim:Slot name="serviceStopTime"><rim:ValueList><rim:Value>20100629235752</rim:Value></rim:ValueList></rim:Slot><rim:Slot name="sourcePatientId"><rim:ValueList><rim:Value>509b043eb50145b^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO</rim:Value></rim:ValueList></rim:Slot><rim:Slot name="sourcePatientInfo"><rim:ValueList><rim:Value>PID-3|509b043eb50145b^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO</rim:Value><rim:Value>PID-5|Pangburn^Jesse^^^Mr.</rim:Value><rim:Value>PID-8|M</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="CreateALotOfDocs2" xml:lang="en-us" /></rim:Name><rim:Description /><rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c124749953059270168361836800644591" nodeRepresentation="Consent"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon classCodes</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="Consent" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c1247499530592-23019297252874789912" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.107"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon confidentialityCodes</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="Normal Sharing" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c1247499530592-76648063659857791623" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.111"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon eventCodeList</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="Authorize Capmed as PHR" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c124749953059225798622105757217934" nodeRepresentation="ScanPDF/IHE 1.x"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon formatCodes</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="ScanPDF/IHE 1.x" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c124749953059238832223641644465185" nodeRepresentation="Home"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon healthcareFacilityTypeCodes</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="Home" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c1247499530592-43545806181135635386" nodeRepresentation="Anesthesia"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>Connect-a-thon practiceSettingCodes</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="Anesthesia" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c124749953059248031002804837969897" nodeRepresentation="34133-9"><rim:Slot name="codingScheme"><rim:ValueList><rim:Value>2.16.840.1.113883.6.1</rim:Value></rim:ValueList></rim:Slot><rim:Name><rim:LocalizedString charset="UTF-8" value="SUMMARIZATION OF EPISODE NOTE" xml:lang="en-us" /></rim:Name></rim:Classification><rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" id="c124749953059248522740387186920198" nodeRepresentation=""><rim:Slot name="authorPerson"><rim:ValueList><rim:Value>90000^Pangburn^Jesse^^^Mr.^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO</rim:Value></rim:ValueList></rim:Slot></rim:Classification><rim:ExternalIdentifier id="i1247499530592-17463818198528273671" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" value="509b043eb50145b^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO"><rim:Name><rim:LocalizedString value="XDSDocumentEntry.patientId" /></rim:Name></rim:ExternalIdentifier><rim:ExternalIdentifier id="i124749953059212010999963280951372" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967" value="1.3.6.1.4.1.21367.2009.1.2.182.097130838507401^2009022441432"><rim:Name><rim:LocalizedString value="XDSDocumentEntry.uniqueId" /></rim:Name></rim:ExternalIdentifier></rim:ExtrinsicObject><rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="a124749953059291493950434175007450" sourceObject="urn:uuid:2fa9ebcc-8fa8-1888-2052-0800271b8967" targetObject="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967"><rim:Slot name="SubmissionSetStatus"><rim:ValueList><rim:Value>Original</rim:Value></rim:ValueList></rim:Slot></rim:Association></rim:RegistryObjectList></lcm:SubmitObjectsRequest><ihe:Document id="urn:uuid:2fa9ec30-8fa8-1888-c28c-0800271b8967"><xop:Include href="cid:1.urn:uuid:8D3C3AFA28B895245C1247499531173@apache.org" xmlns:xop="http://www.w3.org/2004/08/xop/include" /></ihe:Document></ihe:ProvideAndRegisterDocumentSetRequest></soapenv:Body></soapenv:Envelope>
--MIMEBoundaryurn_uuid_8D3C3AFA28B895245C1247499530740
Content-Type: text/xml
Content-Transfer-Encoding: binary
Content-ID: <1.urn:uuid:8D3C3AFA28B895245C1247499531173@apache.org>

<?xml version="1.0" ?><ClinicalDocument classCode="DOCCLIN" moodCode="EVN" xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:hl7-org:v3 CDA.xsd"><typeId extension="POCD_HD000040" root="2.16.840.1.113883.1.3"/><id extension="2009022441432" root="1.3.6.1.4.1.21367.2009.1.2.182.097130838507401"/><code code="34133-9" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC" displayName="Summarization of Episode Note"/><title>CreateALotOfDocs2</title><effectiveTime value="20090629155752-0800"/><confidentialityCode code="1.3.6.1.4.1.21367.2006.7.107" codeSystem="2.16.840.1.113883.5.25" codeSystemName="Connect-a-thon confidentialityCodes" displayName="Normal Sharing"/><languageCode code="en-US"/><recordTarget><patientRole><id extension="509b043eb50145b" root="1.3.6.1.4.1.21367.2005.3.7"/><addr><streetAddressLine/><city/><state/><postalCode/><country/></addr><patient><name><prefix>Mr.</prefix><given>Jesse</given><family>Pangburn</family><suffix/></name><administrativeGenderCode code="M" codeSystem="2.16.840.1.113883.5.1"/><birthTime value=""/></patient></patientRole></recordTarget><author><time value="20090629155752-0800"/><assignedAuthor><id extension="90000" root="1.3.6.1.4.1.21367.2005.3.7"/><assignedPerson><name><prefix>Mr.</prefix><given>Jesse</given><family>Pangburn</family><suffix/></name></assignedPerson><!--representedOrganization>
	   <id extension="aaaaabbbbb" root="1.3.5.35.1.4436.7"/>
	   <name>Dr. Wisemans Clinic</name>
      </representedOrganization--></assignedAuthor></author><author><time value="20090629155752-0800"/><assignedAuthor><id root="1.3.6.4.1.4.1.2835.2.1234"/><assignedAuthoringDevice><code code="CAPTURE" codeSystem="1.2.840.10008.2.16.4" displayName="Image Capture"/><manufacturerModelName>QUOVADX Demo Scanner</manufacturerModelName><softwareName>Demo Client v0.9</softwareName></assignedAuthoringDevice><representedOrganization><id root="1.3.6.4.1.4.1.2835.2"/><name>SOME Scanning Facility</name><addr><streetAddressLine>21 North Ave</streetAddressLine><city>Burlington</city><state>MA</state><postalCode>01803</postalCode><country>USA</country></addr></representedOrganization></assignedAuthor></author><dataEnterer><time value="20090629155752-0800"/><assignedEntity><id extension="22222222" root="1.3.6.4.1.4.1.2835.2"/><assignedPerson><name><prefix>Mrs.</prefix><given>Bernice</given><family>Smith</family></name></assignedPerson></assignedEntity></dataEnterer><custodian><assignedCustodian><representedCustodianOrganization><id root="1.3.6.4.1.4.1.2835.2"/><name>SOME Scanning Facility</name><addr><streetAddressLine>21 North Ave</streetAddressLine><city>Burlington</city><state>MA</state><postalCode>01803</postalCode><country>USA</country></addr></representedCustodianOrganization></assignedCustodian></custodian><legalAuthenticator><time value="20090629155752-0800"/><signatureCode code="S"/><assignedEntity><id extension="11111111" root="1.3.5.35.1.4436.7"/><assignedPerson><name><prefix>Dr.</prefix><given>Bernard</given><family>Wiseman</family><suffix>Sr.</suffix></name></assignedPerson></assignedEntity></legalAuthenticator><documentationOf><serviceEvent><effectiveTime><low value="20090629155752-0800"/><high value="20100629155752-0800"/></effectiveTime></serviceEvent></documentationOf><component><nonXMLBody><text mediaType="application/pdf" representation="B64">JVBERi0xLjQKJeLjz9MKMSAwIG9iaiA8PC9UeXBlL1hPYmplY3QvQ29sb3JTcGFjZS9EZXZpY2VS
R0IvU3VidHlwZS9JbWFnZS9CaXRzUGVyQ29tcG9uZW50IDgvV2lkdGggOTEyL0xlbmd0aCAyNTMx
L0hlaWdodCAyNzAvRmlsdGVyL0ZsYXRlRGVjb2RlPj5zdHJlYW0KeJzt3Oty4jgQBtC8/0uzl6nK
spbUal0MIjmn+EGMLLVkg7/xJDweAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAf4+vrf4/R
HV9fzB3jJks602XRjq0TAGDOc8KJ086uLJTMoidEr0sNb6znnAAPAPBi1YhY3qxrbbn0U26pDtGK
WEExj0flx2qYbA0R3IfsFtN6NTPlbvuNizZUYTlcq3gAgDeKb2l2A+rleTVldUfJ9BmP9ahlzmTx
1X0n6nwMTvmORRuqsDqcyAoAnKZ1y/H51fJ566U4JlX76RaTHLfVW2vQeN9MnaPPgwJuXbTRxYyH
AwB4sVYymciNc5GpW8xEXu0WH+wbF5OfWrXs6pa7F01eBQA+Wpx2JqJOt8HdeTVTfGvfbjH5qbVG
fP2iyasAwEf76Lxa3SWZV+NKWmPF05lek24DeRUA+LVayeT7ZmAZY8o0eGlf9txqnClmNK92ix9K
ZeVewfZ4+plOdi1apsJuwQAAvJdUBgDAsYRVAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAACArq/CuysCAICI4AoAwEdw3xUAgA8iuwIA8ClkVwAAPoXg
CgDARyi/asBvwAIA8EEEVwAAPkL3TuyEd88JAAAiIisAAAAAAAAAAAAAAAAAAACs8K1TAACcTEwF
AOBk8ioAACeTVwEAOJm8CgDAyeRVAABOJq8CAHAyeRUAgJPJqwAAnExeBQDgZPIqAAAnk1cBADiZ
vAoAwMnkVQAATiavAgBwMnkVAICTyasAAJxMXgUA4GTyKgAAJ5NXAQA4mbwKAMDJ5FUAAE4mrwIA
cDJ5FQCAk8mrAACcTF4FAOBk8ioAACeTVwEAOJm8CgDAyeRVAICT/R3W7strt3a+i7wKAPBrHZ5X
v/717ioAAPjPnwD5HCMvkfK5QdmmzJ+XlkEnAAAQq6bHVnYtn5eRNd7YGhEAAKqCe6GLz+VVAAC2
KCPrel4NfsFAXgUAYFQyXo4+v/QfNAAAgFjy//cX86q/twIAYEj1b/ZbPyYzatynvAoAwE12Rc3L
77h6eHh4eHi86wH8DN7XAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAADAb/b19c8js3Gin5v8Gev7Md1mZXQAAF6jTHRzGe/1eTUe
N9NmfXQAAO7Wzavfz+OQlgm91Rue8cbuWEN5NRir2lX1Jm2rfauqywIGwwEAULpk0TJKJW+3dhNd
/hcPuolu/f5qa4LdzLnYPtgdAICq8qbfIxcIy34yebV1A7PaVZxFM/dgW23yOXPv8/glAABK9+XV
MismI2s3jmbuT2aybqvy+57HLwEAUBqNW0E/mV0ykbU7YqZxfFtVXgUA+BQr0evSTzKGxUmyu3uy
8ca8Ono/No7f8ioAwJBu2JvIq4+nzHbZt9ss3h6MFbep9hxn10eYb4Oyk30GRQIAsN3Pjl4/e3YA
AD9bcCP008W3eQEAAAAAAAAAAAAAAIAf5vLtTHf/YdHGIea+C2uxky2DAgCQl/ku03iXleGmZb7R
tDvWaCejzwEAWBd86f2jdtsw/tr/Vp9B58HzoXuk8fMtncirAACvF+fV6sbWLdlMzsxHvnxklVcB
AH6wO/Jqcrhd8a9aTHLfoU7kVQCA1+vm1fIXAIIGr8+rrWidrKfayURhE4MCAJAR59XqvdPW/dXR
4dbzajfKZgrL30zOFCavAgDsFYfPubwaZLYgDI/m1XxYHe1kOq8KqwAA213+Izv53+utH8twW+2t
/HHuNmZQWOYOcDD31oIMNQYA4OO8K9RJkgAAxN54B1JYBQAAAAAAAAAAAAAAADLiL7Oa6+31+050
+8O+fuqVf872uUt3+eqz8tXXl1FuT34b28pAixVucetZlPl6vV0FdPvJfEEfALGf91m68XJ/lPy3
2r6xkhcbrSQ+29+bV8vzNmh8t4/Oq8met4f50fbnvI8Azle9grcundV9gwxQvXkbjNJt0+ozU1Kc
Y4M+455b3caVlxvjHpJTztdWDtQqu7UUre3JQ3YpproUrY3dOQa7BD13+5lYwLifcjqtaY723DqF
qgOVByh+F5Q7tl5ttQzmW51ad7LVlt11S1YYV5Kvs+wzKBKAZ5fP0nLjo/Hh2b3mdj/St7TpFrbS
VTDZlcrLTqZ7CKYc11YdqHrp7A4XNxgqptV+6FgHRZZndff837WAyZMh3p7sef09lTnTyt7Kw9Fq
2ZpLdfvKjDKTjSsc6n9u0GqfADz7/kxuXSPiK9fQleW+560ahroKrhG7Zhos8vR856Y8N9BEg9Fi
uikiqGR0FuUuczVnhs6fuqOTWqxw+tB3D1m5V34RMhPceJhW3olDByX5FgDgonq9fuQ+PPPX1ruf
t2aU372cS9DnXIWt5bpsn8gSK1MeGihZycrilG2CQ5OcUavUS8vpgJGfWqa25AJmet71ngo6bBUw
dJ63htgyi/wuK6dudbJz/cSHAOB36n6WZq5f01eTXc9bMxra/TKXoM/pCjOX7IksMTfliYHiBs/n
zOJFf66S0VlcdlypOfM+mlvhlZ53vae6HZYNpg/u+nttcRGGdmy9tFJnfAgAfqfRCJHv4fLRPX3F
yfTZqifZbXfK69fQ7o5zBVdf2nUdz69GsGPmNGj12T0DkzNq7dvqatcCPnpr0qpnV8+73lPdDltt
4vne9F7LLEJ8Nu7qf6ifuGeAX+77czt5lanu2Npl+tM7c3UIynsuLD/E6Hy7K5AZotVtMPfMpX/o
6LSetxYks/JDF/FuzcljnWn/vGOwZcsCll1lFjY5SqbnoQqDwuIViFep1TJ5FiUHyswunmxcYatx
3E/3tI/XJHMaA7Dx0/KOD14f5i+wd4UdssM5QO9l/QFGbfnkzN/sem+fVO3914pDdiwH6ATWHwAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAKDl
Lxyml40KZW5kc3RyZWFtCmVuZG9iagoyIDAgb2JqIDw8L0xlbmd0aCA1Ni9GaWx0ZXIvRmxhdGVE
ZWNvZGU+PnN0cmVhbQp4nCvkKlSwNDRSMABCI3MDMJ2cq6CfmZtuoOCSrxDIFchVyOUUwgWRDkkB
MnShLNcQoCQA0FoN0wplbmRzdHJlYW0KZW5kb2JqCjQgMCBvYmo8PC9QYXJlbnQgMyAwIFIvQ29u
dGVudHMgMiAwIFIvVHlwZS9QYWdlL1Jlc291cmNlczw8L1hPYmplY3Q8PC9pbWcwIDEgMCBSPj4v
UHJvY1NldCBbL1BERiAvVGV4dCAvSW1hZ2VCIC9JbWFnZUMgL0ltYWdlSV0+Pi9UcmltQm94WzAg
MCA5MTIgMjcwXS9NZWRpYUJveFswIDAgOTEyIDI3MF0+PgplbmRvYmoKMyAwIG9iajw8L1R5cGUv
UGFnZXMvQ291bnQgMS9LaWRzWzQgMCBSXT4+CmVuZG9iago1IDAgb2JqPDwvVHlwZS9DYXRhbG9n
L1BhZ2VzIDMgMCBSPj4KZW5kb2JqCjYgMCBvYmo8PC9Qcm9kdWNlcihpVGV4dCAyLjAuNyBcKGJ5
IGxvd2FnaWUuY29tXCkpL01vZERhdGUoRDoyMDA5MDYyOTE1NTgwMy0wOCcwMCcpL0NyZWF0aW9u
RGF0ZShEOjIwMDkwNjI5MTU1ODAzLTA4JzAwJyk+PgplbmRvYmoKeHJlZgowIDcKMDAwMDAwMDAw
MCA2NTUzNSBmIAowMDAwMDAwMDE1IDAwMDAwIG4gCjAwMDAwMDI3MDIgMDAwMDAgbiAKMDAwMDAw
MzAwNiAwMDAwMCBuIAowMDAwMDAyODI0IDAwMDAwIG4gCjAwMDAwMDMwNTYgMDAwMDAgbiAKMDAw
MDAwMzEwMCAwMDAwMCBuIAp0cmFpbGVyCjw8L1Jvb3QgNSAwIFIvSUQgWzwxY2M5OTAxZjVmZWU0
YjYwNWMxYWRlMWZmYjc0Njk2ND48N2ZlZWEyM2EwMjM3MDMzNjdhZTkxN2VmMDUwYTRhY2U+XS9J
bmZvIDYgMCBSL1NpemUgNz4+CnN0YXJ0eHJlZgozMjMxCiUlRU9GCg==
            </text></nonXMLBody></component></ClinicalDocument>
--MIMEBoundaryurn_uuid_8D3C3AFA28B895245C1247499530740--